export const data = [
  {
    id: 1,
    question: 'როდის მოხდა დიდგორის ბრძოლა?',
    answer:
      '1121 წლის 12 აგვისტოს. ქართველებმა ბრწყინვალე გამარჯვებით გააქციეს უკან ილღაზის 300 000-იანი არმია!',
  },
  {
    id: 2,
    question: 'რა მოხდა 1122 წელს?',
    answer:
      '1122 წლის მიწურულს აღმაშენებელმა დიდხნიანი ალყის შემდგომ აიღო თბილისი და მოსახლეობა სასტიკად ჩახოცა. 500 კაცი სარზე გასვა. მერე ლმობიერება გამოიჩინა და გადასახადები შეუმცირათ.',
  },
  {
    id: 3,
    question: 'ვის დროს გავთამამდით ყველაზე მეტად?',
    answer:
      'თამარის დროს რადგანაც ყველაზე მეტად სტაბილური და მდგრადი სიტუაცია მაშინ იყო. დაჟე შეტევებსაც კი ვაწარმოებდით გარშემო ქვეყნებდათ.',
  },
  {
    id: 4,
    question: 'ვინ დაწერა გრაფი მონტეკრისტო?',
    answer: 'არ ვიცი',
  },
];
