import {useEffect, useState} from 'react';
import * as services from 'services';

const useFAQ = () => {
  const [activeFAQCategoryItem, setActiveFAQCategoryItem] = useState<
    null | number
  >(null);
  const [faqs, setFaqs] = useState<CustomFAQ[]>([]);

  /**
   * Get FAQ categories.
   */
  useEffect(() => {
    (async () => {
      try {
        // const FAQCategories = await services.getFAQCategories();
        // const FAQs: CustomFAQ[] = [];

        // FAQCategories.forEach(async (category) => {
        //   const id = category;
        //   const fetchedFAQs = await services.getFAQsid;
        //   FAQs.push({
        //     ...category,
        //     records: fetchedFAQs,
        //   });
        // });

        setFaqs([
          {
            id: 1008,
            name: 'საკრედიტო ისტორიისა და ქულის გაუმჯობესება',
            records: [
              {
                answer:
                  'დაბალი კატეგორიის მინიჭების მთავარი მიზეზებია: • სესხის 30 დღეზე მეტი ვადაგადაცილება - ფიზიკური პირის შემთხვევაში და 60 დღეზე მეტი ვადაგადაცილება - იურიდული პირის შემთხვევაში. • უახლოეს წარსულში სესხების ხშირი ვადაგადაცილებები და დარიცხული ჯარიმები. • მცირე და არაუზრუნველყოფილი სესხების ხშირი მოხმარება. ყველაზე ეფექტური გზა დაბალი რეიტინგის გასაუმჯობესებლად არის აქტიური ვადაგადაცილების დაფარვა, მომდევნო 6 თვის განმავლობაში გადახდების დროულად შეტანა და ახალი, მცირე და არაუზრუნველყოფილი სესხების აღებისგან თავის შეკავება.',
                id: 1023,
                question:
                  'მაქვს "ე-სამი" კატეგორია, როგორ შევძლებ ზედა კატეგორიებში სწრაფად გადასვლას?',
              },
              {
                answer:
                  'საკრედიტო ქულის დამთვლელი ალგორითმი რამდენიმე ათეულ ცვლადს მოიცავს და ყოველი მათგანი სხვადასხვანაირად, პრიორიტეტულობის მიხედვით, ზემოქმედებს საკრედიტო ქულაზე. ერთი კონკრეტული ქმედება რაიმე განსაკუთრებულ გავლენას ქულის დაანგარიშებაზე ვერ მოახდენს და მას მნიშვნელოვნად ვერ გაზრდის ან შეამცირებს',
                id: 1022,
                question: 'ბევრი ძიების გამო მაქვს "ე-სამი" კატეგორია...',
              },
              {
                answer:
                  'დაბალი ქულის გაუმჯობესება შემდეგნაირად შეგიძლიათ: • ნუ დააგვიანებთ სესხის გადახდას - ნებისმიერი ვადაგადაცილება მკვეთრად აუარესებს ქულას. • ნუ ისარგებლებთ ბევრი სესხით ერთდროულად - ერთი სესხით სარგებლობა უკეთესად მოქმედებს ქულაზე, ვიდრე მცირე სესხების ხშირი მოხმარება. • ეცადეთ, ხანგრძლივად არ ისარგებლოთ საკრედიტო ბარათის სრული ლიმიტით. • რეგულარულად შეამოწმეთ საკუთარი საკრედიტო ისტორია და სესხის მოთხოვნამდე დარწმუნდით, რომ თქვენი მონაცემები მაქსიმალურად აკმაყოფილებს საკრედიტო ორგანიზაციების კრიტერიუმებს."',
                id: 1024,
                question: 'როგორ შეიძლება საკრედიტო ქულის გაზრდა?',
              },
            ],
          },
          {
            id: 1010,
            name: 'საკრედიტო ქულის სიმულატორი',
            records: [],
          },
          {
            id: 1009,
            name: 'საკრედიტო რეპორტი და ქულა',
            records: [],
          },
        ]);
      } catch (e) {
        console.log(e);
      }
    })();
  }, []);

  useEffect(() => console.log(faqs), [faqs]);

  return {
    faqs,
    activeFAQCategoryItem,
    setActiveFAQCategoryItem,
  };
};

export default useFAQ;
